Tekla Open API Reference for Tekla Structures 2025
Matrix.ToString Method
 Returns a string that represents the current matrix.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
The string that represents the current matrix.
See Also
Reference
Matrix Class
Tekla.Structures.Geometry3d Namespace